cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="TMR0">
         <name>TMR1</name>
         <baseAddress>0x40000400</baseAddress>
	 <interrupt>
	    <name>TMR1_EVT</name>
	    <value>12</value>
	    <description>Event</description>
	 </interrupt>
      </peripheral>
      <peripheral derivedFrom="TMR0">
         <name>TMR2</name>
         <baseAddress>0x40000800</baseAddress>
	 <interrupt>
	    <name>TMR2_EVT</name>
	    <value>40</value>
	    <description>Event</description>
	 </interrupt>
      </peripheral>
      <peripheral>
         <name>TMR_RGB</name>
         <description>Timer_RGB with 3 PWM outputs</description>
         <baseAddress>0x40000C00</baseAddress>
         <groupName>TMR_RGB</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000040</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>TMR_RGB_EVT</name>
	    <value>69</value>
	    <description>Event</description>
	 </interrupt>
         <registers>
            <register>
               <name>LOAD</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>16-bit load value</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Load value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CURCNT</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>16-bit timer value</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Current count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>Control</description>
               <resetValue>0x0000000A</resetValue>
               <fields>
                  <field>
                     <name>PRE</name>
                     <description>Prescaler</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>UP</name>
                     <description>Count up</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Timer mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Timer enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CLK</name>
                     <description>Clock select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RLD</name>
                     <description>Reload control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EVTEN</name>
                     <description>Event select</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RSTEN</name>
                     <description>Counter and prescale reset enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SYNCBYP</name>
                     <description>Synchronization bypass</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLRINT</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>Clear interrupt</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Clear timeout interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>EVTCAPT</name>
                     <description>Clear captured event interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CAPTURE</name>
               <addressOffset>0x00000010</addressOffset>
               <size>16</size>
               <description>Capture</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>16-bit captured value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALOAD</name>
               <addressOffset>0x00000014</addressOffset>
               <size>16</size>
               <description>16-bit load value, asynchronous</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Load value, asynchronous</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ACURCNT</name>
               <addressOffset>0x00000018</addressOffset>
               <size>16</size>
               <description>16-bit timer value, asynchronous</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>16</size>
               <description>Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TIMEOUT</name>
                     <description>Timeout event occurred</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CAPTURE</name>
                     <description>Capture event pending</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Timer Busy</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PDOK</name>
                     <description>Clear Interrupt Register synchronization</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CNTRST</name>
                     <description>Counter reset occurring</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM0CTL</name>
               <addressOffset>0x00000020</addressOffset>
               <size>16</size>
               <description>PWM0 Control Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MATCH</name>
                     <description>PWM Match enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IDLESTATE</name>
                     <description>PWM Idle State</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM0MATCH</name>
               <addressOffset>0x00000024</addressOffset>
               <size>16</size>
               <description>PWM0 Match Value</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>PWM Match Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>EVENTSELECT</name>
               <addressOffset>0x00000028</addressOffset>
               <size>16</size>
               <description>Timer Event selection Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EVTRANGE</name>
                     <description>Event select range</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000003F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM1CTL</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>16</size>
               <description>PWM1 Control Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MATCH</name>
                     <description>PWM Match enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IDLESTATE</name>
                     <description>PWM Idle State</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM1MATCH</name>
               <addressOffset>0x00000030</addressOffset>
               <size>16</size>
               <description>PWM1 Match Value</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>PWM Match Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM2CTL</name>
               <addressOffset>0x00000034</addressOffset>
               <size>16</size>
               <description>PWM2 Control Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MATCH</name>
                     <description>PWM Match enabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IDLESTATE</name>
                     <description>PWM Idle State</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWM2MATCH</name>
               <addressOffset>0x00000038</addressOffset>
               <size>16</size>
               <description>PWM2 Match Value</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>PWM Match Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
