cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
            <register>
               <name>CR4SS</name>
               <addressOffset>0x00000054</addressOffset>
               <size>16</size>
               <description>RTC Control 4 for Configuring SensorStrobe Channel</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SS1MSKEN</name>
                     <description>Enable for Thermometer-Code Masking of the SensorStrobe Channel 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_MSK</name>
                           <description>Do not apply a mask to SensorStrobe Channel 1 Register</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THERM_MSK</name>
                           <description>Apply thermometer decoded mask</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SS2MSKEN</name>
                     <description>Enable for Thermometer-Code Masking of the SensorStrobe Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SS3MSKEN</name>
                     <description>Enable for Thermometer-Code Masking of the SensorStrobe Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SS4MSKEN</name>
                     <description>Enable for Thermometer-Code Masking of the SensorStrobe Channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SS1POL</name>
                     <description>SensorSTrobe Channel 1 Polarity Control</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SS2POL</name>
                     <description>SensorStrobe Channel 2 Polarity Control</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SS3POL</name>
                     <description>SensorStrobe Channel 3 Polarity Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SS4POL</name>
                     <description>SensorStrobe Channel 4 Polarity Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SS1ARLEN</name>
                     <description>Enable for Fine Control on SensorStrobe Channel 1 Period and Duty Cycle</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SS2ARLEN</name>
                     <description>Enable for Fine Control on SensorStrobe Channel 2 Period and Duty Cycle</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SS3ARLEN</name>
                     <description>Enable for Fine Control on SensorStrobe Channel 3 Period and Duty Cycle</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSMSK</name>
               <addressOffset>0x00000058</addressOffset>
               <size>16</size>
               <description>RTC Mask for SensorStrobe Channel</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SS1MSK</name>
                     <description>Concatenation of Thermometer-Encoded Masks for the 16-bit SensorStrobe Channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS2MSK</name>
                     <description>SensorStrobe Channel 2 Period Control</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS3MSK</name>
                     <description>SensorStrobe Channel 3 Period Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS4MSK</name>
                     <description>SensorStrobe Channel 4 Period Control</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IC2</name>
               <addressOffset>0x00000064</addressOffset>
               <size>16</size>
               <description>RTC Input Capture Channel 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IC2</name>
                     <description>RTC Input Capture Channel 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>IC3</name>
               <addressOffset>0x00000068</addressOffset>
               <size>16</size>
               <description>RTC Input Capture Channel 3</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IC3</name>
                     <description>RTC Input Capture Channel 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>IC4</name>
               <addressOffset>0x0000006C</addressOffset>
               <size>16</size>
               <description>RTC Input Capture Channel 4</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IC4</name>
                     <description>RTC Input Capture Channel 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS1</name>
               <addressOffset>0x00000070</addressOffset>
               <size>16</size>
               <description>RTC SensorStrobe Channel 1</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS1</name>
                     <description>SensorStrobe Channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS2</name>
               <addressOffset>0x00000074</addressOffset>
               <size>16</size>
               <description>RTC SensorStrobe Channel 2</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS2</name>
                     <description>SensorStrobe Channel 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS3</name>
               <addressOffset>0x00000078</addressOffset>
               <size>16</size>
               <description>RTC SensorStrobe Channel 3</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS3</name>
                     <description>SensorStrobe Channel 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS4</name>
               <addressOffset>0x0000007C</addressOffset>
               <size>16</size>
               <description>RTC SensorStrobe Channel 4</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS4</name>
                     <description>SensorStrobe Channel 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR4</name>
               <addressOffset>0x00000080</addressOffset>
               <size>16</size>
               <description>RTC Status 4</description>
               <resetValue>0x0000F7DF</resetValue>
               <fields>
                  <field>
                     <name>WSYNCSR3</name>
                     <description>Synchronisation Status of Posted Writes to SR3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCR2IC</name>
                     <description>Synchronization Status of Posted Writes to RTC Control 2 for Configuring Input Capture Channels Register</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCR3SS</name>
                     <description>Synchronization Status of Posted Writes to RTC Control 3 for Configuring SensorStrobe Channel Register</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCR4SS</name>
                     <description>Synchronization Status of Posted Writes to RTC Control 4 for Configuring SensorStrobe Channel Register</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSSMSK</name>
                     <description>Synchronization Status of Posted Writes to Masks for SensorStrobe Channel Register</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSS1</name>
                     <description>Synchronization Status of Posted Writes to SensorStrobe Channel 1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSS2</name>
                     <description>Synchronization Status of Posted Writes to SensorStrobe Channel 2</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSS3</name>
                     <description>Synchronization Status of Posted Writes to SensorStrobe Channel 3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSS4</name>
                     <description>Synchronization Status of Posted Writes to SensorStrobe Channel 4</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RSYNCIC0</name>
                     <description>Synchronization Status of Posted Reads of RTC Input Channel 0</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RSYNCIC2</name>
                     <description>Synchronization Status of Posted Reads of RTC Input Channel 2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RSYNCIC3</name>
                     <description>Synchronization Status of Posted Reads of RTC Input Channel 3</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RSYNCIC4</name>
                     <description>Synchronization Status of Posted Reads of RTC Input Channel 4</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSSMSKOT</name>
                     <description>Synchronization Status of Posted Reads Writes to Mask for SensorStrobe Channels on Time Control Register</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
