cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
            <register>
               <name>SR5</name>
               <addressOffset>0x00000084</addressOffset>
               <size>16</size>
               <description>RTC Status 5</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WPENDSR3</name>
                     <description>Pending Status of Posted Clearances of Interrupt Sources in RTC Status 3 Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDCR2IC</name>
                     <description>Pending Status of Posted Writes to RTC Control 2 for Configuring Input Capture Channels Register</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDCR3SS</name>
                     <description>Pending Status of Posted Writes to RTC Control 3 for Configuring SensorStrobe Channel Register</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDCR4SS</name>
                     <description>Pending Status of Posted Writes to RTC Control 4 for Configuring SensorStrobe Channel Register</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSSMSK</name>
                     <description>Pending Status of Posted Writes to RTC Masks for SensorStrobe Channel Register</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSS1</name>
                     <description>Pending Status of Posted Writes to SensorStrobe Channel 1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSS2</name>
                     <description>Pending Status of Posted Writes to SensorStrobe Channel 2</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSS3</name>
                     <description>Pending Status of Posted Writes to SensorStrobe Channel 3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSS4</name>
                     <description>Pending Status of Posted Writes to SensorStrobe Channel 4</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RPENDIC0</name>
                     <description>Pending Status of Posted Reads of Input Capture Channel 0</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RPENDIC2</name>
                     <description>Pending Status of Posted Reads of IC2</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RPENDIC3</name>
                     <description>Pending Status of Posted Reads of IC3</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RPENDIC4</name>
                     <description>Pending Status of Posted Reads of IC4</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSSMSKOT</name>
                     <description>Pending Status of Posted Writes to RTC Masks for SensorStrobe Channel Register</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR6</name>
               <addressOffset>0x00000088</addressOffset>
               <size>16</size>
               <description>RTC Status 6</description>
               <resetValue>0x00007900</resetValue>
               <fields>
                  <field>
                     <name>IC0UNR</name>
                     <description>Sticky Unread Status of the Input Capture Channel 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IC2UNR</name>
                     <description>Sticky Unread Status of the Input Capture Channel 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IC3UNR</name>
                     <description>Sticky Unread Status of the Input Capture Channel 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IC4UNR</name>
                     <description>Sticky Unread Status of the Input Capture Channel 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IC0SNAP</name>
                     <description>Confirmation That RTC Snapshot 0, 1, 2 Registers Reflect the Value of Input-Capture Channel RTC Input Capture Channel 0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>FRZCNTPTR</name>
                     <description>Pointer for the Triple-Read Sequence of FRZCNT</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS1TGT</name>
               <addressOffset>0x0000008C</addressOffset>
               <size>16</size>
               <description>RTC SensorStrobe Channel 1 Target</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS1TGT</name>
                     <description>Current Target Value for the SensorStrobe Channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FRZCNT</name>
               <addressOffset>0x00000090</addressOffset>
               <size>16</size>
               <description>RTC Freeze Count</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FRZCNT</name>
                     <description>RTC Freeze Count. Coherent, Triple 16-Bit Read of the 47-Bit RTC Count</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS2TGT</name>
               <addressOffset>0x00000094</addressOffset>
               <size>16</size>
               <description>RTC SensorStrobe Channel 2 Target</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS2TGT</name>
                     <description>Current, Cumulative Target Time for SensorStrobe Channel 2, Taking Account of Any Auto-reloading</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS3TGT</name>
               <addressOffset>0x00000098</addressOffset>
               <size>16</size>
               <description>RTC SensorStrobe Channel 3 Target</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS3TGT</name>
                     <description>Current, Cumulative Target Time for SensorStrobe Channel 3, Taking Account of Any Auto-reloading</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS1LOWDUR</name>
               <addressOffset>0x000000A0</addressOffset>
               <size>16</size>
               <description>RTC Auto-Reload Low Duration for SensorStrobe Channel 1</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS1LOWDUR</name>
                     <description>Low Duration for SensorStrobe Channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS2LOWDUR</name>
               <addressOffset>0x000000A4</addressOffset>
               <size>16</size>
               <description>RTC Auto-Reload Low Duration for SensorStrobe Channel 2</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS2LOWDUR</name>
                     <description>Low Duration for SensorStrobe Channel 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS3LOWDUR</name>
               <addressOffset>0x000000A8</addressOffset>
               <size>16</size>
               <description>RTC Auto-Reload Low Duration for SensorStrobe Channel 3</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS3LOWDUR</name>
                     <description>Low Duration for SensorStrobe Channel 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS1HIGHDUR</name>
               <addressOffset>0x000000B0</addressOffset>
               <size>16</size>
               <description>RTC Auto-Reload High Duration for SensorStrobe Channel 1</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS1HIGHDUR</name>
                     <description>High Duration for SensorStrobe Channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS2HIGHDUR</name>
               <addressOffset>0x000000B4</addressOffset>
               <size>16</size>
               <description>RTC Auto-Reload High Duration for SensorStrobe Channel 2</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS2HIGHDUR</name>
                     <description>High Duration for SensorStrobe Channel 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SS3HIGHDUR</name>
               <addressOffset>0x000000B8</addressOffset>
               <size>16</size>
               <description>RTC Auto-Reload High Duration for SensorStrobe Channel 3</description>
               <resetValue>0x00008000</resetValue>
               <fields>
                  <field>
                     <name>SS3HIGHDUR</name>
                     <description>High Duration for SensorStrobe Channel 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SSMSKOT</name>
               <addressOffset>0x000000C0</addressOffset>
               <size>16</size>
               <description>RTC Masks for SensorStrobe Channels on Time Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SS1MSKOT</name>
                     <description>Concatenation of Thermometer-encoded Masks for the 16-bit SensorStrobe Channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS2MSKOT</name>
                     <description>SensorStrobe Channel 2 on Time Control</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS3MSKOT</name>
                     <description>SensorStrobe Channel 3 on Time Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS4MSKOT</name>
                     <description>SensorStrobe Channel 4 on Time Control</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR5SSS</name>
               <addressOffset>0x000000C4</addressOffset>
               <size>16</size>
               <description>RTC Control 5 for Configuring SensorStrobe Channel GPIO Sampling</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SS1SMPEN</name>
                     <description>GPIO Input Sample Enable for SensorStrobe Channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS1SMPMTCHIRQEN</name>
                     <description>Sample Activity Interrupt Enable for SensorStrobe Channel 1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS2SMPEN</name>
                     <description>GPIO Input Sample Enable for SensorStrobe Channel 2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS2SMPMTCHIRQEN</name>
                     <description>Sample Activity Interrupt Enable for SensorStrobe Channel 2</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS3SMPEN</name>
                     <description>GPIO Input Sample Enable for SensorStrobe Channel 3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS3SMPMTCHIRQEN</name>
                     <description>Sample Activity Interrupt Enable for SensorStrobe Channel 3</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
