cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
            <register>
               <name>CR6SSS</name>
               <addressOffset>0x000000C8</addressOffset>
               <size>16</size>
               <description>RTC Control 6 for Configuring SensorStrobe Channel GPIO Sampling Edge</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SS1SMPONFE</name>
                     <description>GPIO Sample Around Falling Edge of SensorStrobe Channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SS1NOFES</name>
                           <description>No sampling of input around falling edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS1BFES</name>
                           <description>Input sampled one clock cycle before falling edge of the SensorStrobe channel 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS1FES</name>
                           <description>Input sampled at falling edge of the SensorStrobe channel 1</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS1AFES</name>
                           <description>Input sampled one clock cycle after falling edge of the SensorStrobe channel 1</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SS1SMPONRE</name>
                     <description>GPIO Sample Around Rising Edge of SensorStrobe Channel 1</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SS1NORES</name>
                           <description>No sampling of input around rising edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS1BRES</name>
                           <description>Input sampled one clock cycle before rising edge of the SensorStrobe channel 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS1RES</name>
                           <description>Input sampled at rising edge of the SensorStrobe channel 1</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS1ARES</name>
                           <description>Input sampled one clock cycle after rising edge of the SensorStrobe channel 1</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SS2SMPONFE</name>
                     <description>GPIO Sample Around Falling Edge of SensorStrobe Channel 2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SS2NOFES</name>
                           <description>No sampling of input around falling edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS2BFES</name>
                           <description>Input sampled one clock cycle before falling edge of the SensorStrobe channel 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS2FES</name>
                           <description>Input sampled at falling edge of the SensorStrobe channel 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS2AFES</name>
                           <description>Input sampled one clock cycle after falling edge of the SensorStrobe channel 2</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SS2SMPONRE</name>
                     <description>GPIO Sample Around Rising Edge of SensorStrobe Channel 2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SS2NORES</name>
                           <description>No sampling of input around rising edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS2BRES</name>
                           <description>Input sampled one clock cycle before rising edge of the SensorStrobe channel 2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS2RES</name>
                           <description>Input sampled at rising edge of the SensorStrobe channel 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS2ARES</name>
                           <description>Input sampled one clock cycle after rising edge of the SensorStrobe channel 2</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SS3SMPONFE</name>
                     <description>GPIO Sample Around Falling Edge of SensorStrobe Channel 3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SS3NOFES</name>
                           <description>No sampling of input around falling edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS3BFES</name>
                           <description>Input sampled one clock cycle before falling edge of the SensorStrobe channel 3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS3FES</name>
                           <description>Input sampled at falling edge of the SensorStrobe channel 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS3AFES</name>
                           <description>Input sampled one clock cycle after falling edge of the SensorStrobe channel 3</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SS3SMPONRE</name>
                     <description>GPIO Sample Around Rising Edge of SensorStrobe Channel 3</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SS3NORES</name>
                           <description>No sampling of input around rising edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS3BRES</name>
                           <description>Input sampled one clock cycle before rising edge of the SensorStrobe channel 3</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS3RES</name>
                           <description>Input sampled at rising edge of the SensorStrobe channel 3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS3ARES</name>
                           <description>Input sampled one clock cycle after rising edge of the SensorStrobe channel 3</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR7SSS</name>
               <addressOffset>0x000000CC</addressOffset>
               <size>16</size>
               <description>RTC Control 7 for Configuring SensorStrobe Channel GPIO Sampling Activity</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SS1SMPEXP</name>
                     <description>Expected GPIO Sample for SensorStrobe Channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS1SMPPTRN</name>
                     <description>Sample Activity Selection for SensorStrobe Channel 1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SS1SMPCHNG</name>
                           <description>Current GPIO sample is not same as previous sample</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS1SMPSAME</name>
                           <description>Current GPIO sample is same as previous sample</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS1SMPMTCH</name>
                           <description>Current GPIO sample is same as expected sample</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS1SMPNOMTCH</name>
                           <description>Current GPIO sample is not same as expected sample</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SS2SMPEXP</name>
                     <description>Expected GPIO Sample for SensorStrobe Channel 2</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS2SMPPTRN</name>
                     <description>Sample Activity Selection for SensorStrobe Channel 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SS2SMPCHNG</name>
                           <description>Current GPIO sample is not same as previous sample</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS2SMPSAME</name>
                           <description>Current GPIO sample is same as previous sample</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS2SMPMTCH</name>
                           <description>Current GPIO sample is same as expected sample</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS2SMPNOMTCH</name>
                           <description>Current GPIO sample is not same as expected sample</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SS3SMPEXP</name>
                     <description>Expected GPIO Sample for SensorStrobe Channel 3</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS3SMPPTRN</name>
                     <description>Sample Activity Selection for SensorStrobe Channel 3</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SS3SMPCHNG</name>
                           <description>Current GPIO sample is not same as previous sample</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS3SMPSAME</name>
                           <description>Current GPIO sample is same as previous sample</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS3SMPMTCH</name>
                           <description>Current GPIO sample is same as expected sample</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SS3SMPNOMTCH</name>
                           <description>Current GPIO sample is not same as expected sample</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR7</name>
               <addressOffset>0x000000D0</addressOffset>
               <size>16</size>
               <description>RTC Status 7</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SS1SMP</name>
                     <description>Latest GPIO Sample for SensorStrobe Channel 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SS1SMPMTCHIRQ</name>
                     <description>Sticky Status of GPIO Sample Pattern Match for SensorStrobe Channel 1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS2SMP</name>
                     <description>Latest GPIO Sample for SensorStrobe Channel 2</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SS2SMPMTCHIRQ</name>
                     <description>Sticky Status of GPIO Sample Pattern Match for SensorStrobe Channel 2</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS3SMP</name>
                     <description>Latest GPIO Sample for SensorStrobe Channel 3</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SS3SMPMTCHIRQ</name>
                     <description>Sticky Status of GPIO Sample Pattern Match for SensorStrobe Channel 3</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS1OUT</name>
                     <description>Output Value for SensorStrobe Channel 1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SS2OUT</name>
                     <description>Output Value for SensorStrobe Channel 2</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SS3OUT</name>
                     <description>Output Value for SensorStrobe Channel 3</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SS4OUT</name>
                     <description>Output Value for SensorStrobe Channel 4</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
