cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
            <register>
               <name>SR8</name>
               <addressOffset>0x000000D4</addressOffset>
               <size>16</size>
               <description>RTC Status 8</description>
               <resetValue>0x00003F77</resetValue>
               <fields>
                  <field>
                     <name>WSYNCSS1LOWDUR</name>
                     <description>Synchronisation Status of Posted Writes to SensorStrobe Channel 1 Low Duration Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSS2LOWDUR</name>
                     <description>Synchronisation Status of Posted Writes to SensorStrobe Channel 2 Low Duration Register</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSS3LOWDUR</name>
                     <description>Synchronisation Status of Posted Writes to SensorStrobe Channel 3 Low Duration Register</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSS1HIGHDUR</name>
                     <description>Synchronisation Status of Posted Writes to SensorStrobe Channel 1 High Duration Register</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSS2HIGHDUR</name>
                     <description>Synchronisation Status of Posted Writes to SensorStrobe Channel 2 High Duration Register</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSS3HIGHDUR</name>
                     <description>Synchronisation Status of Posted Writes to SensorStrobe Channel 3 High Duration Register</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCR5SSS</name>
                     <description>Synchronisation Status of Posted Writes to Control 5 for Configuring SensorStrobe Channel Register</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCR6SSS</name>
                     <description>Synchronisation Status of Posted Writes to Control 6 for Configuring SensorStrobe Channel Register</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCCR7SSS</name>
                     <description>Synchronisation Status of Posted Writes to Control 7 for Configuring SensorStrobe Channel Register</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCSR7</name>
                     <description>Synchronisation Status of Posted Writes to Status 7 Register</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCGPMUX0</name>
                     <description>Synchronisation Status of Posted Writes to GPIO Pin Mux Control Register 0</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WSYNCGPMUX1</name>
                     <description>Synchronisation Status of Posted Writes to GPIO Pin Mux Control Register 1</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR9</name>
               <addressOffset>0x000000D8</addressOffset>
               <size>16</size>
               <description>RTC Status 9</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WPENDSS1LOWDUR</name>
                     <description>Pending Status of Posted Writes to SensortStrobe Channel 1 Low Duration Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSS2LOWDUR</name>
                     <description>Pending Status of Posted Writes to SensortStrobe Channel 2 Low Duration Register</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSS3LOWDUR</name>
                     <description>Pending Status of Posted Writes to SensortStrobe Channel 3 Low Duration Register</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSS1HIGHDUR</name>
                     <description>Pending Status of Posted Writes to SensortStrobe Channel 1 High Duration Register</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSS2HIGHDUR</name>
                     <description>Pending Status of Posted Writes to SensortStrobe Channel 2 High Duration Register</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSS3HIGHDUR</name>
                     <description>Pending Status of Posted Writes to SensortStrobe Channel 3 High Duration Register</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDCR5SSS</name>
                     <description>Pending Status of Posted Writes to Control 5 for Configuring SensorStrobe Channel Register</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDCR6SSS</name>
                     <description>Pending Status of Posted Writes to Control 6 for Configuring SensorStrobe Channel Register</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDCR7SSS</name>
                     <description>Pending Status of Posted Writes to Control 7 for Configuring SensorStrobe Channel Register</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDSR7</name>
                     <description>Pending Status of Posted Writes to SR7</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDGPMUX0</name>
                     <description>Pending Status of Posted Writes to GPMUX0</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WPENDGPMUX1</name>
                     <description>Pending Status of Posted Writes to  GPMUX1</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPMUX0</name>
               <addressOffset>0x000000E0</addressOffset>
               <size>16</size>
               <description>RTC GPIO Pin Mux Control Register 0</description>
               <resetValue>0x00004688</resetValue>
               <fields>
                  <field>
                     <name>SS1GPIN0SEL</name>
                     <description>GPIO Mux Selection for SensorStrobe Channel 1 Input0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS1GPIN1SEL</name>
                     <description>GPIO Mux Selection for SensorStrobe Channel 1 Input 1</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS1GPIN2SEL</name>
                     <description>GPIO Mux Selection for SensorStrobe Channel 1 Input 2</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS2GPIN0SEL</name>
                     <description>GPIO Mux Selection for SensorStrobe Channel 2 Input 0</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS2GPIN1SEL</name>
                     <description>GPIO Mux Selection for SensorStrobe Channel 2 Input 1</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPMUX1</name>
               <addressOffset>0x000000E4</addressOffset>
               <size>16</size>
               <description>RTC GPIO Pin Mux Control Register 1</description>
               <resetValue>0x000001F5</resetValue>
               <fields>
                  <field>
                     <name>SS2GPIN2SEL</name>
                     <description>GPIO Mux Selection for SensorStrobe Channel 2 Input 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS3GPIN0SEL</name>
                     <description>GPIO Mux Selection for SensorStrobe Channel 3 Input 0</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS3GPIN1SEL</name>
                     <description>GPIO Mux Selection for SensorStrobe Channel 3 Input 1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS3GPIN2SEL</name>
                     <description>GPIO Mux Selection for SensorStrobe Channel 3 Input 2</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS1DIFFOUT</name>
                     <description>Differential SensorStrobe Out Option for SensorStrobe Channel 1</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SS3DIFFOUT</name>
                     <description>Differential SensorStrobe Out Option for SensorStrobe Channel 3</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
