cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="RTC0">
         <name>RTC1</name>
         <baseAddress>0x40001400</baseAddress>
	 <interrupt>
	    <name>RTC1_EVT</name>
	    <value>0</value>
	    <description>Event</description>
	 </interrupt>
      </peripheral>
      <peripheral>
         <name>SYS</name>
         <description>System Identification and Debug Enable</description>
         <baseAddress>0x40002000</baseAddress>
         <groupName>SYS</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000080</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>SYS_GPIO_INTA</name>
	    <value>9</value>
	    <description>GPIO Interrupt A</description>
	 </interrupt>
	 <interrupt>
	    <name>SYS_GPIO_INTB</name>
	    <value>10</value>
	    <description>GPIO Interrupt B</description>
	 </interrupt>
         <registers>
            <register>
               <name>ADIID</name>
               <addressOffset>0x00000020</addressOffset>
               <size>16</size>
               <description>ADI Identification</description>
               <resetValue>0x00004144</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Reads a fixed value of 0x4144 to indicate to debuggers that they are connected to an Analog Devices implemented Cortex based part</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHIPID</name>
               <addressOffset>0x00000024</addressOffset>
               <size>16</size>
               <description>Chip Identifier</description>
               <resetValue>0x000002A1</resetValue>
               <fields>
                  <field>
                     <name>REV</name>
                     <description>Silicon revision</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PARTID</name>
                     <description>Part identifier</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWDEN</name>
               <addressOffset>0x00000040</addressOffset>
               <size>16</size>
               <description>Serial Wire Debug Enable</description>
               <resetValue>0x00007072</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>To enable SWD interface</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>WDT0</name>
         <description>Watchdog Timer</description>
         <baseAddress>0x40002C00</baseAddress>
         <groupName>WDT0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000020</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>WDT_EXP</name>
	    <value>5</value>
	    <description>Expiration</description>
	 </interrupt>
         <registers>
            <register>
               <name>LOAD</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>Load Value</description>
               <resetValue>0x00001000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Load Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCNT</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>Current Count Value</description>
               <resetValue>0x00001000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Current Count Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>Control</description>
               <resetValue>0x000000E9</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>Timer Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>RST</name>
                           <description>WDT asserts reset when timed out</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT</name>
                           <description>WDT generates interrupt when timed out</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRE</name>
                     <description>Prescaler</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>div1</name>
                           <description>Source clock/1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>div16</name>
                           <description>Source clock/16</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>div256</name>
                           <description>Source clock/256 (default)</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Timer Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>WDT_DIS</name>
                           <description>WDT not enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WDT_EN</name>
                           <description>WDT enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MODE</name>
                     <description>Timer Mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FREE_RUN</name>
                           <description>Free running mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PERIODIC</name>
                           <description>Periodic mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SPARE</name>
                     <description>Unused Spare Bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESTART</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>Clear Interrupt</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRWORD</name>
                     <description>Clear Watchdog</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT</name>
               <addressOffset>0x00000018</addressOffset>
               <size>16</size>
               <description>Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IRQ</name>
                     <description>WDT Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CLRIRQ</name>
                     <description>Clear Interrupt Register Write Sync in Progress</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LOADING</name>
                     <description>Load Register Write Sync in Progress</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>LOAD_MATCH</name>
                           <description>APB and WDT clock domains LOAD values match.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOAD_SYNCING</name>
                           <description>APB LOAD value is being synchronized to WDT clock domain.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COUNTING</name>
                     <description>Control Register Write Sync in Progress</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>COUNT_MATCH</name>
                           <description>APB and WDT clock domain CTRL values match</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>COUNT_SYNCING</name>
                           <description>APB CTRL register values are being synchronized to WDT clock domain.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LOCKED</name>
                     <description>Lock Status Bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
