cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
            <register>
               <name>DMA</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>16</size>
               <description>SPI DMA Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Enable DMA for Data Transfer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TXEN</name>
                     <description>Enable Transmit DMA Request</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RXEN</name>
                     <description>Enable Receive DMA Request</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>FIFO_STAT</name>
               <addressOffset>0x00000020</addressOffset>
               <size>16</size>
               <description>FIFO Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TX</name>
                     <description>SPI Tx FIFO Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RX</name>
                     <description>SPI Rx FIFO Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>RD_CTL</name>
               <addressOffset>0x00000024</addressOffset>
               <size>16</size>
               <description>Read Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMDEN</name>
                     <description>Read Command Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OVERLAP</name>
                     <description>Tx/Rx Overlap Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXBYTES</name>
                     <description>Transmit Byte Count - 1 (Read Command)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>THREEPIN</name>
                     <description>Three Pin SPI Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLOW_CTL</name>
               <addressOffset>0x00000028</addressOffset>
               <size>16</size>
               <description>Flow Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Flow Control Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RDYPOL</name>
                     <description>Polarity of RDY/MISO Line</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RDBURSTSZ</name>
                     <description>Read Data Burst Size - 1</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>10</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000003FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>WAIT_TMR</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>16</size>
               <description>Wait Timer for Flow Control</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Wait Timer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CS_CTL</name>
               <addressOffset>0x00000030</addressOffset>
               <size>16</size>
               <description>Chip Select Control for Multi-slave Connections</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>SEL</name>
                     <description>Chip Select Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CS_OVERRIDE</name>
               <addressOffset>0x00000034</addressOffset>
               <size>16</size>
               <description>Chip Select Override</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CTL</name>
                     <description>CS Override Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
