cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="UART0">
         <name>UART1</name>
         <baseAddress>0x40005400</baseAddress>
	 <interrupt>
	    <name>UART1_EVT</name>
	    <value>66</value>
	    <description>Event</description>
	 </interrupt>
      </peripheral>
      <peripheral>
         <name>BEEP0</name>
         <description>Beeper Driver</description>
         <baseAddress>0x40005C00</baseAddress>
         <groupName>BEEP0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>BEEP_EVT</name>
	    <value>45</value>
	    <description>Event</description>
	 </interrupt>
         <registers>
            <register>
               <name>CFG</name>
               <addressOffset>0x00000000</addressOffset>
               <size>16</size>
               <description>Beeper Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEQREPEAT</name>
                     <description>Beeper Sequence Repeat Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>Beeper Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>ASTARTIRQ</name>
                     <description>Tone A Start IRQ</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>AENDIRQ</name>
                     <description>Tone A End IRQ</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BSTARTIRQ</name>
                     <description>Tone B Start IRQ</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BENDIRQ</name>
                     <description>Tone B End IRQ</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SEQNEARENDIRQ</name>
                     <description>Sequence 1 Cycle from End IRQ</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SEQATENDIRQ</name>
                     <description>Sequence End IRQ</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT</name>
               <addressOffset>0x00000004</addressOffset>
               <size>16</size>
               <description>Beeper Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEQREMAIN</name>
                     <description>Remaining Tone-pair Iterations to Play in Sequence Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Beeper is Busy</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ASTARTED</name>
                     <description>Tone A Has Started</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>AENDED</name>
                     <description>Tone A Has Ended</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BSTARTED</name>
                     <description>Tone B Has Started</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BENDED</name>
                     <description>Tone B Has Ended</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SEQNEAREND</name>
                     <description>Sequencer Last Tone-pair Has Started</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SEQENDED</name>
                     <description>Sequencer Has Ended</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TONEA</name>
               <addressOffset>0x00000008</addressOffset>
               <size>16</size>
               <description>Tone A Data</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>DUR</name>
                     <description>Tone Duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FREQ</name>
                     <description>Tone Frequency</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DIS</name>
                     <description>Output Disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>TONEB</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>16</size>
               <description>Tone B Data</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>DUR</name>
                     <description>Tone Duration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FREQ</name>
                     <description>Tone Frequency</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DIS</name>
                     <description>Output Disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
