cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
            <register>
               <name>HYS3</name>
               <addressOffset>0x00000098</addressOffset>
               <size>16</size>
               <description>Channel 3 Hysteresis</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Hysteresis value for Channel 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000001FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>MONCYC</name>
                     <description>Program number of conversion cycles to monitor channel 3 before raising alert</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EN</name>
                     <description>To enable hysteresis for comparison on Channel 3</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFG1</name>
               <addressOffset>0x000000C0</addressOffset>
               <size>16</size>
               <description>Reference Buffer Low Power Mode</description>
               <resetValue>0x00000400</resetValue>
               <fields>
                  <field>
                     <name>RBUFLP</name>
                     <description>Enable low power mode for reference buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>DMA0</name>
         <description>DMA</description>
         <baseAddress>0x40010000</baseAddress>
         <groupName>DMA0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00001000</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>DMA_CHAN_ERR</name>
	    <value>19</value>
	    <description>Channel Error</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH0_DONE</name>
	    <value>20</value>
	    <description>Channel 0 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH1_DONE</name>
	    <value>21</value>
	    <description>Channel 1 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH2_DONE</name>
	    <value>22</value>
	    <description>Channel 2 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH3_DONE</name>
	    <value>23</value>
	    <description>Channel 3 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH4_DONE</name>
	    <value>24</value>
	    <description>Channel 4 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH5_DONE</name>
	    <value>25</value>
	    <description>Channel 5 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH6_DONE</name>
	    <value>26</value>
	    <description>Channel 6 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH7_DONE</name>
	    <value>27</value>
	    <description>Channel 7 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH8_DONE</name>
	    <value>28</value>
	    <description>Channel 8 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH9_DONE</name>
	    <value>29</value>
	    <description>Channel 9 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH10_DONE</name>
	    <value>30</value>
	    <description>Channel 10 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH11_DONE</name>
	    <value>31</value>
	    <description>Channel 11 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH12_DONE</name>
	    <value>32</value>
	    <description>Channel 12 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH13_DONE</name>
	    <value>33</value>
	    <description>Channel 13 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH14_DONE</name>
	    <value>34</value>
	    <description>Channel 14 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH15_DONE</name>
	    <value>35</value>
	    <description>Channel 15 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH24_DONE</name>
	    <value>39</value>
	    <description>Channel 24 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH16_DONE</name>
	    <value>56</value>
	    <description>Channel 16 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH17_DONE</name>
	    <value>57</value>
	    <description>Channel 17 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH18_DONE</name>
	    <value>58</value>
	    <description>Channel 18 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH19_DONE</name>
	    <value>59</value>
	    <description>Channel 19 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH20_DONE</name>
	    <value>60</value>
	    <description>Channel 20 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH21_DONE</name>
	    <value>61</value>
	    <description>Channel 21 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH22_DONE</name>
	    <value>62</value>
	    <description>Channel 22 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH23_DONE</name>
	    <value>63</value>
	    <description>Channel 23 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH25_DONE</name>
	    <value>67</value>
	    <description>Channel 25 Done</description>
	 </interrupt>
	 <interrupt>
	    <name>DMA0_CH26_DONE</name>
	    <value>68</value>
	    <description>Channel 26 Done</description>
	 </interrupt>
         <registers>
            <register>
               <name>STAT</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>DMA Status</description>
               <resetValue>0x001A0000</resetValue>
               <fields>
                  <field>
                     <name>MEN</name>
                     <description>Enable Status of the Controller</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CHANM1</name>
                     <description>Number of Available DMA Channels Minus 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFG</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>DMA Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MEN</name>
                     <description>Controller Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PDBPTR</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>DMA Channel Primary Control Database Pointer</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Pointer to the Base Address of the Primary Data Structure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADBPTR</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>DMA Channel Alternate Control Database Pointer</description>
               <resetValue>0x00000200</resetValue>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>Base Address of the Alternate Data Structure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWREQ</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>DMA Channel Software Request</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Generate Software Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMSK_SET</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <description>DMA Channel Request Mask Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Mask Requests from DMA Channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RMSK_CLR</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size>
               <description>DMA Channel Request Mask Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Clear Request Mask Set Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>EN_SET</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size>
               <description>DMA Channel Enable Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Enable DMA Channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>EN_CLR</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size>
               <description>DMA Channel Enable Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Disable DMA Channels</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALT_SET</name>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size>
               <description>DMA Channel Primary Alternate Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Control Structure Status / Select Alternate Structure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ALT_CLR</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size>
               <description>DMA Channel Primary Alternate Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Select Primary Data Structure</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRI_SET</name>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size>
               <description>DMA Channel Priority Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Configure Channel for High Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRI_CLR</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>32</size>
               <description>DMA Channel Priority Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHPRICLR</name>
                     <description>Configure Channel for Default Priority Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ERRCHNL_CLR</name>
               <addressOffset>0x00000048</addressOffset>
               <size>32</size>
               <description>DMA per Channel Error Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Per Channel Bus Error Status/Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ERR_CLR</name>
               <addressOffset>0x0000004C</addressOffset>
               <size>32</size>
               <description>DMA Bus Error Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Bus Error Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>INVALIDDESC_CLR</name>
               <addressOffset>0x00000050</addressOffset>
               <size>32</size>
               <description>DMA per Channel Invalid Descriptor Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Per Channel Invalid Descriptor Status/Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>BS_SET</name>
               <addressOffset>0x00000800</addressOffset>
               <size>32</size>
               <description>DMA Channel Bytes Swap Enable Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Byte Swap Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>BS_CLR</name>
               <addressOffset>0x00000804</addressOffset>
               <size>32</size>
               <description>DMA Channel Bytes Swap Enable Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Disable Byte Swap</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
