cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
            <register>
               <name>SRCADDR_SET</name>
               <addressOffset>0x00000810</addressOffset>
               <size>32</size>
               <description>DMA Channel Source Address Decrement Enable Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Source Address Decrement Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRCADDR_CLR</name>
               <addressOffset>0x00000814</addressOffset>
               <size>32</size>
               <description>DMA Channel Source Address Decrement Enable Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Disable Source Address Decrement</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSTADDR_SET</name>
               <addressOffset>0x00000818</addressOffset>
               <size>32</size>
               <description>DMA Channel Destination Address Decrement Enable Set</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Destination Address Decrement Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DSTADDR_CLR</name>
               <addressOffset>0x0000081C</addressOffset>
               <size>32</size>
               <description>DMA Channel Destination Address Decrement Enable Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CHAN</name>
                     <description>Disable Destination Address Decrement</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>27</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x07FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>REVID</name>
               <addressOffset>0x00000FE0</addressOffset>
               <size>32</size>
               <description>DMA Controller Revision ID</description>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>DMA Controller Revision ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>FLCC0</name>
         <description>Flash Controller</description>
         <baseAddress>0x40018000</baseAddress>
         <groupName>FLCC0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>STAT</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CMDBUSY</name>
                     <description>Command busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WRCLOSE</name>
                     <description>WRITE registers are closed</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CMDCOMP</name>
                     <description>Command complete</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WRALCOMP</name>
                     <description>Write almost complete</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CMDFAIL</name>
                     <description>Provides information on command failures</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SLEEPING</name>
                     <description>Flash array is in low power (sleep) mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCERRCMD</name>
                     <description>ECC errors detected during user issued SIGN command</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCRDERR</name>
                     <description>ECC IRQ cause</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>OVERLAP</name>
                     <description>Overlapping Command</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SIGNERR</name>
                     <description>Signature check failure during initialization</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INIT</name>
                     <description>Flash controller initialization in progress</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCINFOSIGN</name>
                     <description>ECC status of flash initialization</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCERRCNT</name>
                     <description>ECC correction counter</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCICODE</name>
                     <description>ICode AHB Bus Error ECC status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ECCDCODE</name>
                     <description>DCode AHB Bus Error ECC status</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CACHESRAMPERR</name>
                     <description>SRAM parity errors in Cache Controller</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ACCESS_MODE</name>
                     <description>Access Mode</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Direct</name>
                           <description>Flash controller is currently in Direct Access mode; user access to all registers is enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Indirect</name>
                           <description>Flash Controller is currently in Indirect Access mode; user access to registers is limited to read-only access of the status register. Full register access will be restored when the Cryptographic module releases control of the flash controller (crypto completes the ongoing operation within the protected key storage region)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Interrupt Enable</description>
               <resetValue>0x00000060</resetValue>
               <fields>
                  <field>
                     <name>CMDCMPLT</name>
                     <description>Command complete interrupt enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WRALCMPLT</name>
                     <description>Write almost complete interrupt enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CMDFAIL</name>
                     <description>Command fail interrupt enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ECC_CORRECT</name>
                     <description>Control whether to generate bus errors, interrupts, or neither in response to 1-bit ECC Correction events</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NONE_cor</name>
                           <description>Do not generate a response to ECC events</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BUS_ERR_cor</name>
                           <description>Generate Bus Errors in response to ECC events</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IRQ_cor</name>
                           <description>Generate IRQs in response to ECC events</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECC_ERROR</name>
                     <description>Control whether to generate bus errors, interrupts, or neither in response to 2-bit ECC Error events</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NONE_err</name>
                           <description>Do not generate a response to ECC events</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BUS_ERR_err</name>
                           <description>Generate Bus Errors in response to ECC events</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IRQ_err</name>
                           <description>Generate IRQs in response to ECC events</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMD</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>Command</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Commands</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>IDLE</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ABORT</name>
                           <description>ABORT</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLEEP</name>
                           <description>Requests flash to enter Sleep mode</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIGN</name>
                           <description>SIGN</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WRITE</name>
                           <description>WRITE</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BLANK_CHECK</name>
                           <description>Checks all of User Space; fails if any bits in user space are cleared</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ERASEPAGE</name>
                           <description>ERASEPAGE</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MASSERASE</name>
                           <description>MASSERASE</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>KH_ADDR</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Write Address</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Address to be written on a WRITE command</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>17</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0001FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KH_DATA0</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Write Lower Data</description>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Lower half of 64-bit dual word data to be written on a Write command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KH_DATA1</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>Write Upper Data</description>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Upper half of 64-bit dual word data to be written on a Write command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PAGE_ADDR0</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size>
               <description>Lower Page Address</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Lower address bits of the page address</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>10</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000003FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
