cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
            <register>
               <name>PAGE_ADDR1</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size>
               <description>Upper Page Address</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Upper address bits of the page address</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>10</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000003FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEY</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <description>Key</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>WR_ABORT_ADDR</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size>
               <description>Write Abort Address</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Address of recently aborted write command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>WRPROT</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size>
               <description>Write Protection</description>
               <resetValue>0xFFFFFFFF</resetValue>
               <fields>
                  <field>
                     <name>WORD</name>
                     <description>Clear bits to write protect related groups of user space pages</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SIGNATURE</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size>
               <description>Signature</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Read signature</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>UCFG</name>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size>
               <description>User Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KHDMAEN</name>
                     <description>Key hole DMA enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>AUTOINCEN</name>
                     <description>Auto Address Increment for Key Hole Access</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIME_PARAM0</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size>
               <description>Time Parameter 0</description>
               <resetValue>0xB8954950</resetValue>
               <fields>
                  <field>
                     <name>DIVREFCLK</name>
                     <description>Divide Reference Clock (by 2)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TNVS</name>
                     <description>PROG/ERASE to NVSTR setup time</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TPGS</name>
                     <description>NVSTR to Program setup time</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TPROG</name>
                     <description>Program time</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TNVH</name>
                     <description>NVSTR Hold time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TRCV</name>
                     <description>Recovery time</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TERASE</name>
                     <description>Erase Time</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>TNVH1</name>
                     <description>NVSTR Hold time during Mass Erase</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TIME_PARAM1</name>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size>
               <description>Time Parameter 1</description>
               <resetValue>0x00000004</resetValue>
               <fields>
                  <field>
                     <name>TWK</name>
                     <description>Wake up time</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WAITSTATES</name>
                     <description>Number of wait states to access flash</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000007</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CURWAITSTATES</name>
                     <description>Current wait states [2:0]</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>ABORT_EN_LO</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>32</size>
               <description>IRQ Abort Enable (Lower Bits)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE[31:0]  Sys IRQ Abort Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ABORT_EN_HI</name>
               <addressOffset>0x00000040</addressOffset>
               <size>32</size>
               <description>IRQ Abort Enable (Upper Bits)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>VALUE[63:32]  Sys IRQ Abort Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECC_CFG</name>
               <addressOffset>0x00000044</addressOffset>
               <size>32</size>
               <description>ECC Configuration</description>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>ECC Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>INFOEN</name>
                     <description>Info space ECC Enable bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PTR</name>
                     <description>ECC start page pointer</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00FFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECC_ADDR</name>
               <addressOffset>0x00000048</addressOffset>
               <size>32</size>
               <description>ECC Status (Address)</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>This register has the address for which ECC error is detected</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>POR_SEC</name>
               <addressOffset>0x00000050</addressOffset>
               <size>32</size>
               <description>Flash Security</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SECURE</name>
                     <description>Set this bit to prevent read or write access to User Space (sticky when set)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>VOL_CFG</name>
               <addressOffset>0x00000054</addressOffset>
               <size>32</size>
               <description>Volatile Flash Configuration</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>INFO_REMAP</name>
                     <description>Alias the info space to the base address of user space</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
