cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
            <register>
               <name>INT</name>
               <addressOffset>0x00000030</addressOffset>
               <size>16</size>
               <description>Port Interrupt Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>DS</name>
               <addressOffset>0x00000034</addressOffset>
               <size>16</size>
               <description>Port Drive Strength Select</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PIN00</name>
                     <description>Drive Strength Pin 00</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN00</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN00</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN01</name>
                     <description>Drive Strength Pin 01</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN01</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN01</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN02</name>
                     <description>Drive Strength Pin 02</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN02</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN02</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN03</name>
                     <description>Drive Strength Pin 03</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN03</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN03</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN04</name>
                     <description>Drive Strength Pin 04</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN04</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN04</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN05</name>
                     <description>Drive Strength Pin 05</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN05</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN05</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN06</name>
                     <description>Drive Strength Pin 06</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN06</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN06</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN07</name>
                     <description>Drive Strength Pin 07</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN07</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN07</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN08</name>
                     <description>Drive Strength Pin 08</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN08</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN08</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN09</name>
                     <description>Drive Strength Pin 09</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN09</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN09</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN10</name>
                     <description>Drive Strength Pin 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN10</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN10</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN11</name>
                     <description>Drive Strength Pin 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN11</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN11</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN12</name>
                     <description>Drive Strength Pin 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN12</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN12</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN13</name>
                     <description>Drive Strength Pin 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN13</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN13</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN14</name>
                     <description>Drive Strength Pin 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN14</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN14</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PIN15</name>
                     <description>Drive Strength Pin 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>SINGLE_PIN15</name>
                           <description>Single Drive Strength</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DOUBLE_PIN15</name>
                           <description>Double Drive Strength</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
