cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="GPIO0">
         <name>GPIO1</name>
         <baseAddress>0x40020040</baseAddress>
      </peripheral>
      <peripheral derivedFrom="GPIO0">
         <name>GPIO2</name>
         <baseAddress>0x40020080</baseAddress>
      </peripheral>
      <peripheral derivedFrom="GPIO0">
         <name>GPIO3</name>
         <baseAddress>0x400200C0</baseAddress>
      </peripheral>
      <peripheral>
         <name>SPORT0</name>
         <description>Serial Port</description>
         <baseAddress>0x40038000</baseAddress>
         <groupName>SPORT0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00000100</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>SPORT_A_EVT</name>
	    <value>36</value>
	    <description>Channel A Event</description>
	 </interrupt>
	 <interrupt>
	    <name>SPORT_B_EVT</name>
	    <value>37</value>
	    <description>Channel B Event</description>
	 </interrupt>
         <registers>
            <register>
               <name>CTL_A</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Half SPORT &#39;A&#39; Control Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SPEN</name>
                     <description>Serial Port Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_DIS</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_EN</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSMUXSEL</name>
                     <description>Frame Sync Multiplexer Select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_FS_MUX_DIS</name>
                           <description>Disable frame sync multiplexing</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_FS_MUX_EN</name>
                           <description>Enable frame sync multiplexing</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CKMUXSEL</name>
                     <description>Clock Multiplexer Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_CLK_MUX_DIS</name>
                           <description>Disable serial clock multiplexing</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_CLK_MUX_EN</name>
                           <description>Enable serial clock multiplexing</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LSBF</name>
                     <description>Least-Significant Bit First</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_MSB_FIRST</name>
                           <description>MSB first sent/received</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_LSB_FIRST</name>
                           <description>LSB first sent/received</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLEN</name>
                     <description>Serial Word Length</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ICLK</name>
                     <description>Internal Clock</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_EXTERNAL_CLK</name>
                           <description>External clock</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_INTERNAL_CLK</name>
                           <description>Internal clock</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OPMODE</name>
                     <description>Operation mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_SERIAL</name>
                           <description>DSP standard</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_TIMER_EN_MODE</name>
                           <description>Timer_enable mode</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CKRE</name>
                     <description>Clock Rising Edge</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_CLK_FALL_EDGE</name>
                           <description>Clock falling edge</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_CLK_RISE_EDGE</name>
                           <description>Clock rising edge</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSR</name>
                     <description>Frame Sync Required</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_FS_NOT_REQ</name>
                           <description>No frame sync required</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_FS_REQ</name>
                           <description>Frame sync required</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IFS</name>
                     <description>Internal Frame Sync</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_EXTERNAL_FS</name>
                           <description>External frame sync</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_INTERNAL_FS</name>
                           <description>Internal frame sync</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIFS</name>
                     <description>Data-Independent Frame Sync</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_DATA_DEP_FS</name>
                           <description>Data-dependent frame sync</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_DATA_INDP_FS</name>
                           <description>Data-independent frame sync</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LFS</name>
                     <description>Active-Low Frame Sync</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_FS_LO</name>
                           <description>Active high frame sync</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_FS_HI</name>
                           <description>Active low frame sync</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LAFS</name>
                     <description>Late Frame Sync</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_EARLY_FS</name>
                           <description>Early frame sync</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_LATE_FS</name>
                           <description>Late frame sync</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PACK</name>
                     <description>Packing Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_PACK_DIS</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_PACK_8BIT</name>
                           <description>8-bit packing enable</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_PACK_16BIT</name>
                           <description>16-bit packing enable</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSERRMODE</name>
                     <description>Frame Sync Error Operation</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GCLKEN</name>
                     <description>Gated Clock Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_GCLK_DIS</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_GCLK_EN</name>
                           <description>Enable</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DATMUXSEL</name>
                     <description>Data Multiplexer select</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SPTRAN</name>
                     <description>Serial Port Transfer Direction</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_RX</name>
                           <description>Receive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_TX</name>
                           <description>Transmit</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DMAEN</name>
                     <description>DMA Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIV_A</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Half SPORT &#39;A&#39; Divisor Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLKDIV</name>
                     <description>Clock Divisor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FSDIV</name>
                     <description>Frame Sync Divisor</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN_A</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>Half SPORT A&#39;s Interrupt Enable register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TF</name>
                     <description>Transfer Finish Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_TXFIN_DIS</name>
                           <description>Transfer finish Interrupt is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_TXFIN_EN</name>
                           <description>Transfer Finish Interrupt is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DERRMSK</name>
                     <description>Data Error (Interrupt) Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FSERRMSK</name>
                     <description>Frame Sync Error (Interrupt) Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DATA</name>
                     <description>Data request interrupt to the core</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SYSDATERR</name>
                     <description>Data error for system writes or reads</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
