cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
            <register>
               <name>STAT_A</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Half SPORT &#39;A&#39; Status register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TFI</name>
                     <description>Transmit Finish Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DERR</name>
                     <description>Data Error Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>FSERR</name>
                     <description>Frame Sync Error Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DATA</name>
                     <description>Data Buffer status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SYSDATERR</name>
                     <description>System Data Error Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DXS</name>
                     <description>Data Transfer Buffer Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_EMPTY</name>
                           <description>Empty</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_PART_FULL</name>
                           <description>Partially full</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_FULL</name>
                           <description>Full</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>NUMTRAN_A</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Half SPORT A Number of transfers register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Number of transfers (Half SPORT A)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNVT_A</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>Half SPORT &#39;A&#39; CNV width</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WID</name>
                     <description>CNV signal width: Half SPORT A</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>Polarity of the CNV signal</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNVT2FS</name>
                     <description>CNV to FS duration: Half SPORT A</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TX_A</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <description>Half SPORT &#39;A&#39; Tx Buffer Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Transmit Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_A</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size>
               <description>Half SPORT &#39;A&#39; Rx Buffer Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Receive Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL_B</name>
               <addressOffset>0x00000040</addressOffset>
               <size>32</size>
               <description>Half SPORT &#39;B&#39; Control Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SPEN</name>
                     <description>Serial Port Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LSBF</name>
                     <description>Least-Significant Bit First</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SLEN</name>
                     <description>Serial Word Length</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ICLK</name>
                     <description>Internal Clock</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OPMODE</name>
                     <description>Operation mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CKRE</name>
                     <description>Clock Rising Edge</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FSR</name>
                     <description>Frame Sync Required</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IFS</name>
                     <description>Internal Frame Sync</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DIFS</name>
                     <description>Data-Independent Frame Sync</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFS</name>
                     <description>Active-Low Frame Sync</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LAFS</name>
                     <description>Late Frame Sync</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PACK</name>
                     <description>Packing Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_PACK_DIS</name>
                           <description>Disable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_PACK_8BIT</name>
                           <description>8-bit packing enable</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_PACK_16BIT</name>
                           <description>16-bit packing enable</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FSERRMODE</name>
                     <description>Frame Sync Error Operation</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GCLKEN</name>
                     <description>Gated Clock Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SPTRAN</name>
                     <description>Serial Port Transfer Direction</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DMAEN</name>
                     <description>DMA Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>DIV_B</name>
               <addressOffset>0x00000044</addressOffset>
               <size>32</size>
               <description>Half SPORT &#39;B&#39; Divisor Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLKDIV</name>
                     <description>Clock Divisor</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>FSDIV</name>
                     <description>Frame Sync Divisor</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>IEN_B</name>
               <addressOffset>0x00000048</addressOffset>
               <size>32</size>
               <description>Half SPORT B&#39;s Interrupt Enable register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TF</name>
                     <description>Transmit Finish Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_TXFIN_DIS</name>
                           <description>Transfer Finish Interrupt is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_TXFIN_EN</name>
                           <description>Transfer Finish Interrupt is Enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DERRMSK</name>
                     <description>Data Error (Interrupt) Mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FSERRMSK</name>
                     <description>Frame Sync Error (Interrupt) Mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DATA</name>
                     <description>Data request interrupt to the core</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SYSDATERR</name>
                     <description>Data error for system writes or reads</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>STAT_B</name>
               <addressOffset>0x0000004C</addressOffset>
               <size>32</size>
               <description>Half SPORT &#39;B&#39; Status register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>TFI</name>
                     <description>Transmit Finish Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DERR</name>
                     <description>Data Error Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>FSERR</name>
                     <description>Frame Sync Error Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DATA</name>
                     <description>Data Buffer status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SYSDATERR</name>
                     <description>System Data Error Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DXS</name>
                     <description>Data Transfer Buffer Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CTL_EMPTY</name>
                           <description>Empty</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_PART_FULL</name>
                           <description>Partially full</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTL_FULL</name>
                           <description>Full</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>NUMTRAN_B</name>
               <addressOffset>0x00000050</addressOffset>
               <size>32</size>
               <description>Half SPORT B Number of transfers register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Number of transfers (Half SPORT B)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000FFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNVT_B</name>
               <addressOffset>0x00000054</addressOffset>
               <size>32</size>
               <description>Half SPORT &#39;B&#39; CNV width register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WID</name>
                     <description>CNV signal width: Half SPORT B</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>POL</name>
                     <description>Polarity of the CNV signal</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CNVT2FS</name>
                     <description>CNV to FS duration: Half SPORT B</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000000FF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
