cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
            <register>
               <name>STAT</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Status Register</description>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>INRDY</name>
                     <description>Input Buffer Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>OUTRDY</name>
                     <description>Output Data Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INOVR</name>
                     <description>Overflow in the Input Buffer</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SHADONE</name>
                     <description>SHA Computation Complete</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SHABUSY</name>
                     <description>SHA Busy. in Computation</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>INWORDS</name>
                     <description>Number of Words in the Input Buffer</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>OUTWORDS</name>
                     <description>Number of Words in the Output Buffer</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HMACBUSY</name>
                     <description>Status Bit Indicates HMAC Busy</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HMACDONE</name>
                     <description>Status Bit Indicates HMAC Done</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>HMACMSGRDY</name>
                     <description>Status Bit Indicates HMAC is Message Ready</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PRKSTOR_CMD_DONE</name>
                     <description>Indicates Command Done for PrKStor</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PRKSTOR_CMD_FAIL</name>
                     <description>Indicates Last Command Issued Failed</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PRKSTOR_RET_STATUS</name>
                     <description>ECC Errors in the PRKSTOR_RETRIEVE Command</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CMD_ISSUED</name>
                     <description>Last Command Issued to PrKStor</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PRKSTOR_BUSY</name>
                     <description>Indicates PrKSTOR is Busy</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>INBUF</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>Input Buffer</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Input Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>OUTBUF</name>
               <addressOffset>0x00000018</addressOffset>
               <size>32</size>
               <description>Output Buffer</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Output Buffer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>NONCE0</name>
               <addressOffset>0x0000001C</addressOffset>
               <size>32</size>
               <description>Nonce Bits [31:0]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Word 0: Nonce Bits [31:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>NONCE1</name>
               <addressOffset>0x00000020</addressOffset>
               <size>32</size>
               <description>Nonce Bits [63:32]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Word 1: Nonce Bits [63:32]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>NONCE2</name>
               <addressOffset>0x00000024</addressOffset>
               <size>32</size>
               <description>Nonce Bits [95:64]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Word 2: Nonce Bits [95:64]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>NONCE3</name>
               <addressOffset>0x00000028</addressOffset>
               <size>32</size>
               <description>Nonce Bits [127:96]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Word 3: Nonce Bits [127:96]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY0</name>
               <addressOffset>0x0000002C</addressOffset>
               <size>32</size>
               <description>AES Key Bits [31:0]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [3:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY1</name>
               <addressOffset>0x00000030</addressOffset>
               <size>32</size>
               <description>AES Key Bits [63:32]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [7:4]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY2</name>
               <addressOffset>0x00000034</addressOffset>
               <size>32</size>
               <description>AES Key Bits [95:64]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [11:8]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY3</name>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size>
               <description>AES Key Bits [127:96]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [15:12]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY4</name>
               <addressOffset>0x0000003C</addressOffset>
               <size>32</size>
               <description>AES Key Bits [159:128]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [19:16]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY5</name>
               <addressOffset>0x00000040</addressOffset>
               <size>32</size>
               <description>AES Key Bits [191:160]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [23:20]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY6</name>
               <addressOffset>0x00000044</addressOffset>
               <size>32</size>
               <description>AES Key Bits [223:192]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [27:24]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>AESKEY7</name>
               <addressOffset>0x00000048</addressOffset>
               <size>32</size>
               <description>AES Key Bits [255:224]</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Key: Bytes [31:28]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CNTRINIT</name>
               <addressOffset>0x0000004C</addressOffset>
               <size>32</size>
               <description>Counter Initialization Vector</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Counter Initialization Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>20</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x000FFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH0</name>
               <addressOffset>0x00000050</addressOffset>
               <size>32</size>
               <description>SHA Bits [31:0]</description>
               <resetValue>0x6A09E667</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH0</name>
                     <description>Word 0: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH1</name>
               <addressOffset>0x00000054</addressOffset>
               <size>32</size>
               <description>SHA Bits [63:32]</description>
               <resetValue>0xBB67AE85</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH1</name>
                     <description>Word 1: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH2</name>
               <addressOffset>0x00000058</addressOffset>
               <size>32</size>
               <description>SHA Bits [95:64]</description>
               <resetValue>0x3C6EF372</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH2</name>
                     <description>Word 2: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH3</name>
               <addressOffset>0x0000005C</addressOffset>
               <size>32</size>
               <description>SHA Bits [127:96]</description>
               <resetValue>0xA54FF53A</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH3</name>
                     <description>Word 3: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH4</name>
               <addressOffset>0x00000060</addressOffset>
               <size>32</size>
               <description>SHA Bits [159:128]</description>
               <resetValue>0x510E527F</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH4</name>
                     <description>Word 4: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
