cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
            <register>
               <name>SHAH5</name>
               <addressOffset>0x00000064</addressOffset>
               <size>32</size>
               <description>SHA Bits [191:160]</description>
               <resetValue>0x9B05688C</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH5</name>
                     <description>Word 5: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH6</name>
               <addressOffset>0x00000068</addressOffset>
               <size>32</size>
               <description>SHA Bits [223:192]</description>
               <resetValue>0x1F83D9AB</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH6</name>
                     <description>Word 6: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHAH7</name>
               <addressOffset>0x0000006C</addressOffset>
               <size>32</size>
               <description>SHA Bits [255:224]</description>
               <resetValue>0x5BE0CD19</resetValue>
               <fields>
                  <field>
                     <name>SHAHASH7</name>
                     <description>Word 7: SHA Hash</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHA_LAST_WORD</name>
               <addressOffset>0x00000070</addressOffset>
               <size>32</size>
               <description>SHA Last Word and Valid Bits Information</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>O_Last_Word</name>
                     <description>Last SHA Input Word</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>O_Bits_Valid</name>
                     <description>Bits Valid in SHA Last Word Input</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000001F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CCM_NUM_VALID_BYTES</name>
               <addressOffset>0x00000074</addressOffset>
               <size>32</size>
               <description>NUM_VALID_BYTES</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NUM_VALID_BYTES</name>
                     <description>Number of Valid Bytes in CCM Last Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRKSTORCFG</name>
               <addressOffset>0x00000078</addressOffset>
               <size>32</size>
               <description>PRKSTOR Configuration</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KEY_INDEX</name>
                     <description>Index of Key in PRKSTOR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000007F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>CMD</name>
                     <description>Command Input for PRKSTOR</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000000F</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW0</name>
               <addressOffset>0x00000080</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 0</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW0</name>
                     <description>KUW [31:0]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW1</name>
               <addressOffset>0x00000084</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 1</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW1</name>
                     <description>KUW [63:32]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW2</name>
               <addressOffset>0x00000088</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 2</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW2</name>
                     <description>KUW [95:64]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW3</name>
               <addressOffset>0x0000008C</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 3</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW3</name>
                     <description>KUW [127:96]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW4</name>
               <addressOffset>0x00000090</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 4</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW4</name>
                     <description>KUW [159:128]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW5</name>
               <addressOffset>0x00000094</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 5</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW5</name>
                     <description>KUW [191:160]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW6</name>
               <addressOffset>0x00000098</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 6</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW6</name>
                     <description>KUW [223:192]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW7</name>
               <addressOffset>0x0000009C</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 7</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW7</name>
                     <description>KUW [255:224]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW8</name>
               <addressOffset>0x000000A0</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 8</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW8</name>
                     <description>KUW [287:256]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW9</name>
               <addressOffset>0x000000A4</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 9</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW9</name>
                     <description>KUW [319:288]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW10</name>
               <addressOffset>0x000000A8</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 10</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW10</name>
                     <description>KUW [351:320]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW11</name>
               <addressOffset>0x000000AC</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 11</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW11</name>
                     <description>KUW [383:352]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW12</name>
               <addressOffset>0x000000B0</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 12</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW12</name>
                     <description>KUW [415:384]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW13</name>
               <addressOffset>0x000000B4</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 13</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW13</name>
                     <description>KUW [447:416]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW14</name>
               <addressOffset>0x000000B8</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 14</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW14</name>
                     <description>KUW [479:448]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUW15</name>
               <addressOffset>0x000000BC</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Register 15</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>KUW15</name>
                     <description>KUW [511:480]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUWValStr1</name>
               <addressOffset>0x000000C0</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Validation String [63:32]</description>
               <resetValue>0xA6A6A6A6</resetValue>
               <fields>
                  <field>
                     <name>InitialValue0</name>
                     <description>Initial Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>KUWValStr2</name>
               <addressOffset>0x000000C4</addressOffset>
               <size>32</size>
               <description>Key Wrap Unwrap Validation String [31:0]</description>
               <resetValue>0xA6A6A6A6</resetValue>
               <fields>
                  <field>
                     <name>InitialValue1</name>
                     <description>Initial Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
