cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PMG0</name>
         <description>Power Management </description>
         <baseAddress>0x4004C000</baseAddress>
         <groupName>PMG0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00004000</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>PMG0_VREG_OVR</name>
	    <value>6</value>
	    <description>Voltage Regulator (VREG) Overvoltage</description>
	 </interrupt>
	 <interrupt>
	    <name>PMG0_BATT_RANGE</name>
	    <value>7</value>
	    <description>Battery Voltage (VBAT) Out of Range</description>
	 </interrupt>
         <registers>
            <register>
               <name>IEN</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>Power Supply Monitor Interrupt Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VBAT</name>
                     <description>Enable Interrupt for VBAT</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>VREGUNDR</name>
                     <description>Enable Interrupt When VREG Under Voltage (Below 1V)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>VREGOVR</name>
                     <description>Enable Interrupt When VREG Over Voltage (Above 1.32V)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RANGEBAT</name>
                     <description>Battery Monitor Range</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>region1</name>
                           <description>Configure to generate interrupt if VBAT in Region1</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>region2</name>
                           <description>Configure to generate interrupt if VBAT in Region2</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>region3</name>
                           <description>Configure to generate interrupt if VBAT in Region3</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NA</name>
                           <description>NA</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IENBAT</name>
                     <description>Interrupt Enable for VBAT Range</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>PSM_STAT</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>Power Supply Monitor Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VBATUNDR</name>
                     <description>Status Bit Indicating an Alarm That Battery is Below 1.8V</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>VREGUNDR</name>
                     <description>Status Bit for Alarm Indicating VREG is Below 1V</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>VREGOVR</name>
                     <description>Status Bit for Alarm Indicating Over Voltage for VREG</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WICENACK</name>
                     <description>WIC Enable Acknowledge from Cortex</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RANGE1</name>
                     <description>VBAT Range1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RANGE2</name>
                     <description>VBAT Range2</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RANGE3</name>
                     <description>VBAT Range3</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RORANGE1</name>
                     <description>VBAT Range1</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>batstat1</name>
                           <description>VBAT NOT in the range specified</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>batstat0</name>
                           <description>VBAT in the range specified</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RORANGE2</name>
                     <description>VBAT Range2</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RORANGE3</name>
                     <description>VBAT Range3</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWRMOD</name>
               <addressOffset>0x00000008</addressOffset>
               <size>32</size>
               <description>Power Mode Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MODE</name>
                     <description>Power Mode Bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FLEXI</name>
                           <description>Flexi Mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIBERNATE</name>
                           <description>Hibernate Mode</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SHUTDOWN</name>
                           <description>Shutdown Mode</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MONVBATN</name>
                     <description>Monitor VBAT During Hibernate Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>MONITOR_EN</name>
                           <description>VBAT monitor enabled in PMG block</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MONITOR_DIS</name>
                           <description>VBAT monitor disabled in PMG block</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWRKEY</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Key Protection for PMG_PWRMOD and PMG_SRAMRET</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Power Control Key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SHDN_STAT</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Shutdown Status Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EXTINT0</name>
                     <description>Interrupt from External Interrupt 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EXTINT1</name>
                     <description>Interrupt from External Interrupt 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>EXTINT2</name>
                     <description>Interrupt from External Interrupt 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>RTC</name>
                     <description>Interrupt from RTC</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAMRET</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>Control for Retention SRAM in Hibernate Mode</description>
               <resetValue>0xFF000000</resetValue>
               <fields>
                  <field>
                     <name>RET1</name>
                     <description>Enable Retention Bank 1 (12 KB)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RET2</name>
                     <description>Enable Retention Bank 3 and Bank 4 (32 KB)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RET3</name>
                     <description>Enable Retention Bank 5 (32 KB)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>RET4</name>
                     <description>Enable Retention Bank 6 and Bank 7 (32 KB)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>HIBERNATE_SRAM_LOAD_MODE</name>
                     <description>Hibernate Mode SRAM Load Mode Control</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>TRIM</name>
               <addressOffset>0x00000038</addressOffset>
               <size>32</size>
               <description>Trimming Bits</description>
               <resetValue>0x0A8AA2A2</resetValue>
               <fields>
                  <field>
                     <name>hibernate_load_mode</name>
                     <description>Hibernate Mode Load Mode Control</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>HIGH_LOAD</name>
                           <description>High hibernate load</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW_LOAD</name>
                           <description>Low hibernate load</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RST_STAT</name>
               <addressOffset>0x00000040</addressOffset>
               <size>32</size>
               <description>Reset Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>POR</name>
                     <description>Power-on Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>EXTRST</name>
                     <description>External Reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>WDRST</name>
                     <description>Watchdog Timeout</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PORSRC</name>
                     <description>Power on Reset Source</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FAILSAFE_HV</name>
                           <description>POR triggered because VBAT drops below Fail Safe</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RST_VBAT</name>
                           <description>POR trigger because VBAT supply (VBAT &lt; 1.7 V)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RST_VREG</name>
                           <description>POR triggered because VDD supply (VDD &lt; 1.08 V)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FAILSAFE_LV</name>
                           <description>POR triggered because VREG drops below Fail Safe</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
