cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
            <register>
               <name>CTL1</name>
               <addressOffset>0x00000044</addressOffset>
               <size>32</size>
               <description>HPBUCK Control</description>
               <resetValue>0x00A00000</resetValue>
               <fields>
                  <field>
                     <name>HPBUCKEN</name>
                     <description>Enable HP Buck</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>HPBUCK_LD_MODE</name>
                     <description>HP Buck Load Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>HPBUCKLOWLOAD</name>
                           <description>HPBUCK Low load mode is enabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HPBUCKHIGHLOAD</name>
                           <description>HPBUCK High load mode is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HPBUCK_LOWPWR_MODE</name>
                     <description>HP Buck Low Power Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>LOWPWRDisable</name>
                           <description>HPBUCK Low power mode is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOWPWREnable</name>
                           <description>HPBUCK Low power mode is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>XINT0</name>
         <description>External interrupt configuration</description>
         <baseAddress>0x4004C080</baseAddress>
         <groupName>XINT0</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00004000</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>XINT_EVT0</name>
	    <value>1</value>
	    <description>External Wakeup Interrupt n</description>
	 </interrupt>
	 <interrupt>
	    <name>XINT_EVT1</name>
	    <value>2</value>
	    <description>External Wakeup Interrupt n</description>
	 </interrupt>
	 <interrupt>
	    <name>XINT_EVT2</name>
	    <value>3</value>
	    <description>External Wakeup Interrupt n</description>
	 </interrupt>
	 <interrupt>
	    <name>XINT_EVT3</name>
	    <value>4</value>
	    <description>External Wakeup Interrupt n</description>
	 </interrupt>
         <registers>
            <register>
               <name>CFG0</name>
               <addressOffset>0x00000000</addressOffset>
               <size>32</size>
               <description>External Interrupt Configuration</description>
               <resetValue>0x00200000</resetValue>
               <fields>
                  <field>
                     <name>IRQ0MDE</name>
                     <description>External Interrupt 0 Mode Registers</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRQ0EN</name>
                     <description>External Interrupt 0 Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRQ1MDE</name>
                     <description>External Interrupt 1 Mode Registers</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRQ1EN</name>
                     <description>External Interrupt 1 Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRQ2MDE</name>
                     <description>External Interrupt 2 Mode Registers</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRQ2EN</name>
                     <description>External Interrupt 2 Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRQ3MDE</name>
                     <description>External Interrupt 3 Mode Registers</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IRQ3EN</name>
                     <description>External Interrupt 3 Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>UART_RX_EN</name>
                     <description>External Interrupt Using UART_RX Enable Bit</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>UART_RX_MDE</name>
                     <description>External Interrupt Using UART_RX Wakeup Mode Registers</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXT_STAT</name>
               <addressOffset>0x00000004</addressOffset>
               <size>32</size>
               <description>External Wakeup Interrupt Status</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>STAT_EXTINT0</name>
                     <description>Interrupt Status Bit for External Interrupt 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STAT_EXTINT1</name>
                     <description>Interrupt Status Bit for External Interrupt 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STAT_EXTINT2</name>
                     <description>Interrupt Status Bit for External Interrupt 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STAT_EXTINT3</name>
                     <description>Interrupt Status Bit for External Interrupt 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>STAT_UART_RXWKUP</name>
                     <description>Interrupt Status Bit for UART RX WAKEUP Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLR</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>External Interrupt Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IRQ0</name>
                     <description>External Interrupt 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IRQ1</name>
                     <description>External Interrupt 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IRQ2</name>
                     <description>External Interrupt 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>IRQ3</name>
                     <description>External Interrupt 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>UART_RX_CLR</name>
                     <description>External Interrupt Clear for UART_RX WAKEUP Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>NMICLR</name>
               <addressOffset>0x00000014</addressOffset>
               <size>32</size>
               <description>Non-maskable Interrupt Clear</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLR</name>
                     <description>NMI Clear</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
