cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CLKG0_OSC</name>
         <description>Clocking </description>
         <baseAddress>0x4004C100</baseAddress>
         <groupName>CLKG0_OSC</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00004000</size>
            <usage>registers</usage>
         </addressBlock>
	 <interrupt>
	    <name>CLKG_XTAL_OSC_EVT</name>
	    <value>41</value>
	    <description>Crystal Oscillator Event</description>
	 </interrupt>
	 <interrupt>
	    <name>CLKG_PLL_EVT</name>
	    <value>43</value>
	    <description>PLL Event</description>
	 </interrupt>
	 <interrupt>
	    <name>CLKG_ROOTCLK_ERR</name>
	    <value>71</value>
	    <description>Root Clock Error</description>
	 </interrupt>
         <registers>
            <register>
               <name>KEY</name>
               <addressOffset>0x0000000C</addressOffset>
               <size>32</size>
               <description>Key Protection for OSCCTRL</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Oscillator key</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <addressOffset>0x00000010</addressOffset>
               <size>32</size>
               <description>Oscillator Control</description>
               <resetValue>0x00060002</resetValue>
               <fields>
                  <field>
                     <name>LFCLK_MUX</name>
                     <description>32 kHz clock select mux</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HFOSC_EN</name>
                     <description>High frequency internal oscillator enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFX_EN</name>
                     <description>Low frequency crystal oscillator enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HFX_EN</name>
                     <description>High frequency crystal oscillator enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFX_BYP</name>
                     <description>Low frequency crystal oscillator Bypass</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFX_MON_EN</name>
                     <description>LFXTAL clock monitor and Clock FAIL interrupt enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFOSC_OK</name>
                     <description>Status of LFOSC oscillator</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HFOSC_OK</name>
                     <description>Status of HFOSC oscillator</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LFX_OK</name>
                     <description>Status of LFXTAL oscillator</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HFX_OK</name>
                     <description>Status of HFXTAL oscillator</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LFX_AUTSW_EN</name>
                     <description>Enables automatic Switching of the LF Mux to LFOSC on LFXTAL Failure</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFX_AUTSW_STA</name>
                     <description>Status of automatic switching of the LF Mux to LFOSC upon detection of LFXTAL failure</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFX_ROBUST_EN</name>
                     <description>LFXTAL Mode select</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LFX_ROBUST_LD</name>
                     <description>LFXTAL Robust Mode Load select</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ROOT_MON_EN</name>
                     <description>ROOT clock monitor and Clock FAIL interrupt enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ROOT_AUTSW_EN</name>
                     <description>Enables automatic Switching of the Root clock  to HFOSC on Root clock Failure</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ROOT_AUTSW_STA</name>
                     <description>Status of automatic switching of the Root clock to HFOSC upon detection of Root clock failure</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ROOT_FAIL_STA</name>
                     <description>Root clock (crystal clock) Not Stable</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>LFX_FAIL_STA</name>
                     <description>LF XTAL (crystal clock) Not Stable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
