cmsis-svd/cmsis-svd/data/AnalogDevices/ADuCM4050.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PMG0_TST</name>
         <description>Power Management </description>
         <baseAddress>0x4004C200</baseAddress>
         <groupName>PMG0_TST</groupName>
         <addressBlock>
            <offset>0</offset>
            <size>0x00004000</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SRAM_CTL</name>
               <addressOffset>0x00000060</addressOffset>
               <size>32</size>
               <description>Control for SRAM Parity and Instruction SRAM</description>
               <resetValue>0x80000000</resetValue>
               <fields>
                  <field>
                     <name>BNK1EN</name>
                     <description>Enable Initialization</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BNK2EN</name>
                     <description>Enable Initialization</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>BNK7EN</name>
                     <description>Enable Initialization</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>STARTINIT</name>
                     <description>Start Manual Initialization</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>AUTOINIT</name>
                     <description>Automatic Initialization on Wake up from Hibernate Mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>ABTINIT</name>
                     <description>Abort Current Initialization. Self-cleared</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PENBNK0</name>
                     <description>Enable Parity Check</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PENBNK1</name>
                     <description>Enable Parity Check</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PENBNK2</name>
                     <description>Enable Parity Check</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PENBNK3</name>
                     <description>Enable Parity Check</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PENBNK4</name>
                     <description>Enable Parity Check</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PENBNK5</name>
                     <description>Enable Parity Check</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PENBNK6</name>
                     <description>Enable Parity Check</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>PENBNK7</name>
                     <description>Enable Parity Check</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
                  <field>
                     <name>INSTREN</name>
                     <description>Enables 32kB Instruction SRAM</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x00000001</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SRAM_INITSTAT</name>
               <addressOffset>0x00000064</addressOffset>
               <size>32</size>
               <description>Initialization Status Register</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BNK0DONE</name>
                     <description>Bank 0 Initialization Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_BANK0_INIT</name>
                           <description>Bank 0 not initialized</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK0_INIT</name>
                           <description>Bank 0 initialized</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BNK1DONE</name>
                     <description>Bank 1 Initialization Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_BANK1_INIT</name>
                           <description>Bank 1 not initialized</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK1_INIT</name>
                           <description>Bank 1 initialized</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BNK2DONE</name>
                     <description>Bank 2 Initialization Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_BANK2_INIT</name>
                           <description>Bank 2 not initialized</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK2_INIT</name>
                           <description>Bank 2 initialized</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BNK3DONE</name>
                     <description>Bank 3 Initialization Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_BANK3_INIT</name>
                           <description>Bank 3 not initialized</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK3_INIT</name>
                           <description>Bank 3 initialized</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BNK4DONE</name>
                     <description>Bank 4 Initialization Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_BANK4_INIT</name>
                           <description>Bank 4 not initialized</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK4_INIT</name>
                           <description>Bank 4 initialized</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BNK5DONE</name>
                     <description>Bank 5 Initialization Status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_BANK5_INIT</name>
                           <description>Bank 5 not initialized</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK5_INIT</name>
                           <description>Bank 5 initialized</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BNK6DONE</name>
                     <description>Bank 6 Initialization Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_BANK6_INIT</name>
                           <description>Bank 6 not initialized</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK6_INIT</name>
                           <description>Bank 6 initialized</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BNK7DONE</name>
                     <description>Bank 7 Initialization Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>NO_BANK7_INIT</name>
                           <description>Bank 7 not initialized</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK7_INIT</name>
                           <description>Bank 7 initialized</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLR_LATCH_GPIOS</name>
               <addressOffset>0x00000068</addressOffset>
               <size>16</size>
               <description>Clear GPIO After Shutdown Mode</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE</name>
                     <description>Clear the Latches for GPIOs</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                     <access>write-only</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0x0000FFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCRPAD_IMG</name>
               <addressOffset>0x0000006C</addressOffset>
               <size>32</size>
               <description>Scratch Pad Image</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Scratch Image</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-write</access>
                     <writeConstraint>
                        <range>
                           <minimum>0x00000000</minimum>
                           <maximum>0xFFFFFFFF</maximum>
                        </range>
                     </writeConstraint>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCRPAD_3V_RD</name>
               <addressOffset>0x00000070</addressOffset>
               <size>32</size>
               <description>Scratch Pad Saved in Battery Domain</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>DATA</name>
                     <description>Reading the Scratch Pad Stored in Shutdown Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FAST_SHT_WAKEUP</name>
               <addressOffset>0x00000074</addressOffset>
               <size>32</size>
               <description>Fast Shutdown Wake-up Enable</description>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>FAST_SHT_WAKEUP</name>
                     <description>Enables Fast Shutdown Wake-up</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>FASTWAKE_DIS</name>
                           <description>Fast shutdown wakeup is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FASTWAKE_EN</name>
                           <description>Fast shutdown wakeup is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
